shomagan/stm32f103_base/src/control.c
        }
        if(ligth2.stop_time < current_sec){
            ligth2_do_control(0);
            soft_state_control(SOFT_DISABLE);
            SSD1306_DrawCircle(98, 33, 7, SSD1306_COLOR_BLACK,1.0);
            SSD1306_UpdateScreen();
        }else{
            u32 pass_time = current_sec - time_table_ligth2[ligth2.number].start_time * 60;
            float part = (float)pass_time/(float)time_table_ligth2[ligth2.number].length;
            SSD1306_DrawCircle(98, 33, 7, SSD1306_COLOR_WHITE,part);
            SSD1306_UpdateScreen();
        }
        SSD1306_GotoXY(0, 12);
        SSD1306_Puts("air", &Font_7x10, SSD1306_COLOR_WHITE);
        SSD1306_GotoXY(28, 12);
        SSD1306_Puts("flow", &Font_7x10, SSD1306_COLOR_WHITE);
        SSD1306_GotoXY(63, 12);
        SSD1306_Puts("led", &Font_7x10, SSD1306_COLOR_WHITE);
        SSD1306_GotoXY(91, 12);
        SSD1306_Puts("led", &Font_7x10, SSD1306_COLOR_WHITE);
        SSD1306_UpdateScreen();

    }

    return 0x00;
}
static void air_do_control(u8 enable){
    if(enable){
        LL_GPIO_SetOutputPin(AIR_PORT,AIR_PIN);
    }else{
        LL_GPIO_ResetOutputPin(AIR_PORT,AIR_PIN);
    }
}
static void flow_do_control(u8 enable){
    if(enable){
        LL_GPIO_SetOutputPin(FLOW_PORT,FLOW_PIN);
    }else{
        LL_GPIO_ResetOutputPin(FLOW_PORT,FLOW_PIN);
    }
}
static void ligth1_do_control(u8 enable){
    if(enable){
        LL_GPIO_SetOutputPin(LIGTH1_PORT,LIGTH1_PIN);
    }else{
        LL_GPIO_ResetOutputPin(LIGTH1_PORT,LIGTH1_PIN);
    }
}
static void ligth2_do_control(u8 enable){
    if(enable){
        LL_GPIO_SetOutputPin(LIGTH2_PORT,LIGTH2_PIN);
    }else{
        LL_GPIO_ResetOutputPin(LIGTH2_PORT,LIGTH2_PIN);
    }
}

/**
 * @brief set pwm output
 * @param value - [0;100]
 * */
void set_pwm_value(float value){
    u16 pulse = 0;
    static u16 pulse_prev = MAX_PWM_VALUE+1;
    value = value > 100.0f?100.0f:value;
    value = value < 0.0f?0.0f:value;
    value = value/100.0f;
    TIM_OC_InitTypeDef pwm_handle;
    pwm_handle.OCMode = TIM_OCMODE_PWM1;
    if(value >= 0.99f){
        pulse = MAX_PWM_VALUE;
    }else if(value <= 0.01f){
        pulse = 0;
    }else{
        pulse = (u16)(MAX_PWM_VALUE * value);
    }
    if(pulse_prev != pulse){
#if USE_CONST_PWM==0
        pwm_handle.Pulse = pulse;
        pwm_handle.OCPolarity = TIM_OCPOLARITY_HIGH;
        pwm_handle.OCFastMode = TIM_OCFAST_ENABLE;
        if (HAL_TIM_PWM_ConfigChannel(&htim3, &pwm_handle, TIM_CHANNEL_1) != HAL_OK){
            _Error_Handler(__FILE__, __LINE__);
        }
        HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
#endif

    }
}
/**
 * @brief set pwm output
 * @param value - [0;100]
 * */
static void set_pwm_value_const(float value){
    u16 pulse = 0;
    static u16 pulse_prev = MAX_PWM_VALUE+1;
    value = value > 100.0f?100.0f:value;
    value = value < 0.0f?0.0f:value;
    value = value/100.0f;
    TIM_OC_InitTypeDef pwm_handle;
    pwm_handle.OCMode = TIM_OCMODE_PWM1;
    if(value >= 0.99f){
        pulse = MAX_PWM_VALUE;
    }else if(value <= 0.01f){
        pulse = 0;
    }else{
        pulse = (u16)(MAX_PWM_VALUE * value);
    }
    if(pulse_prev != pulse){
#if USE_CONST_PWM
        pwm_handle.Pulse = pulse;
        pwm_handle.OCPolarity = TIM_OCPOLARITY_HIGH;
        pwm_handle.OCFastMode = TIM_OCFAST_ENABLE;
        if (HAL_TIM_PWM_ConfigChannel(&htim3, &pwm_handle, TIM_CHANNEL_1) != HAL_OK){
            _Error_Handler(__FILE__, __LINE__);
        }
        HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
#endif
        pulse_prev = pulse;
    }
}
/**
 * @brief set pwm output
 * @param value - [0;100]
 * */
void set_controller_value(float value){
    if(value > 0.0f){
        LL_GPIO_SetOutputPin(PID_OUT_PORT_3, PID_OUT_PIN_3);
    }else{
        LL_GPIO_ResetOutputPin(PID_OUT_PORT_3, PID_OUT_PIN_3);
    }
}
#define IntegralAccum -25
void pid_exec(pid_in_type * FBInputs,pid_var_type * FBVars,\
                  pid_out_type * FBOutputs) {
    pid_in_type *IN =  FBInputs;
    pid_var_type *VAR =  FBVars;
    pid_out_type *OUT = FBOutputs;
    float error_diff; //"невязка" и её изменение
    float du_kp;
    float du_ki;
    float du_kd;
    float du_out;
    if (IN->rezet.data.bit){
        VAR->prev_error_integral.data.float32 = 0.0;
        VAR->error_integral.data.float32  = 0.0;
        VAR->number_tick.data.uint32=0.0;
        VAR->prev_control_integral.data.float32 = IN->position.data.float32;
        IN->rezet.data.bit = 0;
    }
    if (IN->enable.data.bit){
        error_diff = IN->require_value.data.float32 - IN->current_value.data.float32;    //гистерезис не реагирования
        if ((error_diff > -IN->gist_tube.data.float32)&&(error_diff < IN->gist_tube.data.float32)) {
//            error_diff = 0.0;
        }
        if (VAR->number_tick.data.uint32 != 0){
            du_kp = IN->kp.data.float32 * ((error_diff - VAR->error_integral.data.float32));
            du_ki = IN->ki.data.float32 * error_diff;
            if (VAR->number_tick.data.uint32 >= 2){  //добавим дифф составляющию только после 3 такта
                du_kd = IN->kd.data.float32 * ((error_diff - 2*VAR->error_integral.data.float32 + VAR->prev_error_integral.data.float32));
            }else{
                du_kd = 0.0;
            }
        }else{  //при первом расчете расчитываем только Коэфф пропорциональности
            du_kp = IN->kp.data.float32 * (error_diff); //при включении PID не делим на dT
            if (IN->position.data.float32 > 100.0f){VAR->prev_control_integral.data.float32  = 100.0f;}
            if (IN->position.data.float32 < -100.0f){VAR->prev_control_integral.data.float32  = -100.0f;}
            else{ VAR->prev_control_integral.data.float32  = IN->position.data.float32; }
            du_ki = 0.0f;
            du_kd = 0.0f;
        }
        du_out = du_kp + du_ki + du_kd;
        if (du_out > 100.0f) du_out = 100.0f;
        else if (du_out < -100.0f) du_out = -100.0f;
        if (IN->reverse_control.data.bit) du_out = -du_out;
        VAR->prev_control_integral.data.float32 += du_out ;
        VAR->prev_error_integral.data.float32 = VAR->error_integral.data.float32;
        VAR->error_integral.data.float32 = error_diff;
        if (VAR->prev_control_integral.data.float32 > (100.0f + IntegralAccum)) VAR->prev_control_integral.data.float32 = 100.0f + IntegralAccum;
        else if (VAR->prev_control_integral.data.float32 < (-100.0f - IntegralAccum)) VAR->prev_control_integral.data.float32 = -100.0f - IntegralAccum;
        OUT->test.data.float32 = du_out;
        VAR->number_tick.data.uint32++;
    }else{
        VAR->prev_error_integral.data.float32 =  0.0f;
        VAR->error_integral.data.float32  =  0.0f;
        VAR->number_tick.data.uint32= 0.0f;
        if (IN->position.data.float32 > 100.0f){VAR->prev_control_integral.data.float32  = 100.0f;}
        if (IN->position.data.float32 < -100.0f){VAR->prev_control_integral.data.float32  = -100.0f;}
        else{ VAR->prev_control_integral.data.float32  = IN->position.data.float32; }
    }
    //выдаем значение на выход
    OUT->output.data.float32 = VAR->prev_control_integral.data.float32 ;
}

void soft_state_control(soft_state_t command){
    u32 current_time = osKernelSysTick();
    if(soft_state != command){
        soft_state = command;
        soft_time_start = current_time;
    }
    if ((current_time-soft_time_start)<SOFT_TIME_INTERVAL_MS){
        float value_pwm;
        switch(soft_state){
        case SOFT_DISABLE:
            set_pwm_value(0.0);
            if(osThreadIsSuspended(soft_handle_task_id)!=osOK){
                osThreadSuspend(soft_handle_task_id);
            }
            break;
        case SOFT_SUSPEND:
            if(osThreadIsSuspended(soft_handle_task_id)!=osOK){
                osThreadSuspend(soft_handle_task_id);
            }
            break;
        case SOFT_AWAKE:
            value_pwm = (((current_time-soft_time_start)*100)/SOFT_TIME_INTERVAL_MS);
            set_pwm_value(value_pwm);
            if(osThreadIsSuspended(soft_handle_task_id)==osOK){
                osThreadResume(soft_handle_task_id);
            }
            break;
        case SOFT_SLEEP:
            value_pwm = (((SOFT_TIME_INTERVAL_MS-(current_time-soft_time_start))*100)/SOFT_TIME_INTERVAL_MS);
            set_pwm_value(value_pwm);
            if(osThreadIsSuspended(soft_handle_task_id)==osOK){
                osThreadResume(soft_handle_task_id);
            }
            break;
        }
    }
}
static void soft_handle_task( const void *parameters){
    uint32_t task_time = osKernelSysTick();
    osThreadId thread_id;
    thread_id = osThreadGetId();
    osThreadSuspend(thread_id);
    while(1){
        u32 current_time = osKernelSysTick();
        if ((current_time-soft_time_start)<SOFT_TIME_INTERVAL_MS){
            float value_pwm;
            switch(soft_state){
            case SOFT_DISABLE:
                set_pwm_value(0.0);
                break;
            case SOFT_AWAKE:
                value_pwm = (((current_time-soft_time_start)*100)/SOFT_TIME_INTERVAL_MS);
                set_pwm_value(value_pwm);
                break;
            case SOFT_SLEEP:
                value_pwm = (((SOFT_TIME_INTERVAL_MS-(current_time-soft_time_start))*100)/SOFT_TIME_INTERVAL_MS);
                set_pwm_value(value_pwm);
                break;
            }
        }
        osDelayUntil(&task_time,1);
    }
}
#endif //CONTROL_C
